Revit 2024 API
FabricationAncillaryUsage.Length Property
 Length of required ancillaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public double Length { get; }
Visual Basic
Public ReadOnly Property Length As Double
	Get
Visual C++
public:
property double Length {
	double get ();
}
See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace